-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 26, 2026 at 07:15 AM
-- Server version: 10.6.19-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `primacom_mini_erp`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `sku` varchar(64) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `category` varchar(128) DEFAULT NULL,
  `unit` varchar(32) DEFAULT NULL,
  `cost` decimal(12,2) DEFAULT NULL,
  `price` decimal(12,2) DEFAULT NULL,
  `stock` int(11) DEFAULT NULL,
  `company_id` int(11) DEFAULT NULL,
  `shop` varchar(128) DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL,
  `deleted_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `sku`, `name`, `description`, `category`, `unit`, `cost`, `price`, `stock`, `company_id`, `shop`, `status`, `deleted_at`) VALUES
(1, 'SKU-001', 'Seed A', 'High yield seed', 'Seeds', 'bag', 100.00, 200.00, 500, 1, 'เทพมงคล', 'Inactive', NULL),
(2, 'FERT-001', 'ปุ๋ย แสงราชสีห์', 'ปุ๋ยสูตร A', 'ปุ๋ยเม็ด', 'ถุง', 80.00, 200.00, 500, 1, 'แสนพรีม่า', 'Inactive', NULL),
(3, 'SEED-001', 'เมล็ดพันธุ์ A', 'เมล็ดผลผลิตสูง', 'เมล็ด', 'ซอง', 50.00, 120.00, 200, 1, 'เทพมงคล', 'Inactive', NULL),
(4, 'dsfsdfsdfsd', 'dfdfdfdfd', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 0.00, 0, 1, 'เทพมงคล', 'Inactive', NULL),
(5, '3SOSR050001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 300.00, 790.00, 3000, 2, 'พรีออนิค', 'Inactive', NULL),
(6, '1SDSR050001', 'ปุ๋ยอินทรีย์เคมี สิงห์ชมพู 6-3-3 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 1150.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(7, '3SOSR025001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 445.00, 0, 2, 'พรีออนิค', 'Inactive', NULL),
(8, 'SCSR050002', 'ปุ๋ยอินทรีย์เคมี สิงห์เขียว 4-4-12 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 1195.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(9, 'SCSR050001', 'ปุ๋ยอินทรีย์เคมี สิงห์ส้ม 12-4-4 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 1215.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(10, '1SDSR025001', 'ปุ๋ยอินทรีย์เคมี สิงห์ชมพู 6-3-3 ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 670.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(11, '1SSSR025001', 'สารปรับปรุงดิน ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 435.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(12, '1SDSR025002', 'ปุ๋ยอินทรีย์เคมี สิงห์ดำ 22-0-3 ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 0.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(13, 'PTSR01L001', 'จุลินทรีย์ปรับปรุงดินชนิดน้ำ สิงห์พลัส ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 400.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(14, 'LCSR500001', 'ไคโตซานพลัส ตราเเสนราชสีห์ ขนาด 500 ซีซี', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 290.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(15, 'PTSR001001', 'สิงห์บูส ตราแสนราชสีห์ ขนาด 1 กิโลกรัม', '', 'ชีวภัณฑ์', 'ถุง', 0.00, 290.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(16, 'LASR01L001', 'อะมิโนเฟรช ตราแสนราชสีห์ ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 540.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(18, 'LFSR500001', 'ปุ๋ยเคมีน้ำ แคลเซียม โบรอน ตราแสนราชสีห์ ขนาด 500 ซีซี', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 250.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(19, 'FR-PN001', 'เสื้อแสนราชสีห์ (พรีออนิค)', '', 'เสื้อ', 'ถุง', 0.00, 0.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(20, 'PTTM500001', 'จุลินทรีย์ปรับปรุงดินชนิดผง ซุปเปอร์ไตรโค ตราเทพมงคล ขนาด 500 กรัม', '', 'ชีวภัณฑ์', 'ซอง', 1.00, 290.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(21, 'LNTM01L002', 'ปุ๋ยเคมีน้ำ 4-24-24 ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 1.00, 540.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(22, 'PHTM500001', 'บิว-เมธามิค ตราเทพมงคล ขนาด 500 กรัม', '', 'ชีวภัณฑ์', 'ซอง', 1.00, 330.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(23, 'LFTM01L001', 'แคลโบมิคพลัส ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 1.00, 440.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(24, 'LNTM01L001', 'ปุ๋ยเคมีน้ำ 21-3-3 ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 1.00, 440.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(25, 'LATM01L001', 'ปุ๋ยน้ำอะมิโนมิค ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 740.00, 0, 1, 'เทพมงคล', 'Active', NULL),
(26, 'LCTM500001', 'ไคโตซานมิค ตราเทพมงคล (ไคโตซานพืช) ขนาด 500 ซีซี', '', 'ชีวภัณฑ์', 'ขวด', 1.00, 290.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(27, 'FR-TM001', 'เสื้อตราเทพมงคล คละสี', '', 'เสื้อ', 'ตัว', 0.00, 0.00, 1000, 1, 'เทพมงคล', 'Active', NULL),
(28, 'PBTM500001', 'ซุปเปอร์บีที ตราเทพมงคล ขนาด 500 กรัม', '', 'ชีวภัณฑ์', 'ถุง', 1.00, 390.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(29, 'LSTM01L001', 'สารจับใบ ไฮมิค ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 1.00, 530.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(30, 'LSTM500001', 'สารจับใบ ไฮมิค ตราเทพมงคล ขนาด 500 ซีซี', '', 'ชีวภัณฑ์', 'ขวด', 1.00, 290.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(31, 'PITM150001', 'ซุปเปอร์ไบโอ ตราเทพมงคล ขนาด 150 กรัม', '', 'ชีวภัณฑ์', 'ซอง', 1.00, 510.00, 10000, 1, 'เทพมงคล', 'Active', NULL),
(34, '3SOSR050001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 790.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Inactive', NULL),
(35, '1SDSR050001', 'ปุ๋ยอินทรีย์เคมี สิงห์ชมพู 6-3-3 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 1150.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(36, '3SOSR025001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 445.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Inactive', NULL),
(37, 'SCSR050002', 'ปุ๋ยอินทรีย์เคมี สิงห์เขียว 4-4-12 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 1195.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(38, 'SCSR050001', 'ปุ๋ยอินทรีย์เคมี สิงห์ส้ม 12-4-4 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 1215.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(39, '1SDSR025001', 'ปุ๋ยอินทรีย์เคมี สิงห์ชมพู 6-3-3 ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 670.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(40, '1SSSR025001', '	สารปรับปรุงดิน ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 435.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(41, '1SDSR025002', '	ปุ๋ยอินทรีย์เคมี สิงห์ดำ 22-0-3 ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 0.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(42, 'FR-PN001', 'เสื้อแสนราชสีห์ (พรีออนิค)', '', 'เสื้อ', 'ตัว', 0.00, 0.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(43, '1SOSR050001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 790.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(44, '1SOSR025001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 445.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(45, 'PROMO-003', '123456', 'ทดสอบสินค้า', 'ชีวภัณฑ์', 'กระสอบ', 0.00, 200.00, 0, 5, 'ทดสอบร้านค้า1', 'Active', NULL),
(58, 'PTTM500001', 'ซุปเปอร์ไตรโค', 'เสื้อโปโลคุณภาพดี', 'ชีวภัณฑ์', 'ซอง', 95.00, 290.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(59, 'PHTM500001', 'บิวเมธามิค', '', 'ชีวภัณฑ์', 'ซอง', 105.00, 330.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(60, 'PBTM500001', 'ซุปเปอร์ บีที', '', 'ชีวภัณฑ์', 'ซอง', 145.00, 390.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(61, 'PITM150001', 'จุลินทรีย์ย่อยสลายฟาง', '', 'ชีวภัณฑ์', 'ซอง', 120.00, 510.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(62, 'LCTM500001', 'ไคโตซาน', '', 'ชีวภัณฑ์', 'ขวด', 80.00, 290.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(63, 'LATM01L001', 'อะมิโน-มิค', '', 'ชีวภัณฑ์', 'ขวด', 200.00, 740.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(64, 'LSTM01L001', 'ไฮมิค สารจับใบ 1000cc', '', 'ชีวภัณฑ์', 'ขวด', 220.00, 530.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(65, 'LSTM500001', 'ไฮมิค สารจับใบ 500cc', '', 'ชีวภัณฑ์', 'ขวด', 120.00, 290.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(66, 'LNTM01L002', 'ปุ๋ยน้ำ 4-24-24', '', 'ชีวภัณฑ์', 'ขวด', 200.00, 540.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(67, 'LNTM01L001', 'ปุ๋ยน้ำ 21-3-3', '', 'ชีวภัณฑ์', 'ขวด', 140.00, 440.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(69, 'LFTM01L001', 'แคลโบมิค พลัส', '', 'ชีวภัณฑ์', 'ขวด', 185.00, 440.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(70, '3SOSR025001', 'สิงห์ทอง 25 ก.ก. ปุ๋ยอินทรีย์', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 290.00, 445.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(71, '3SOSR050001', 'สิงห์ทอง 50 ก.ก. ปุ๋ยอินทรีย์', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 500.00, 790.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(72, 'SCSR050002', 'สิงห์เขียว 50ก.ก. 4-4-12', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 805.00, 1195.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(73, 'SCSR050001', 'สิงห์ส้ม 50ก.ก. 12-4-4', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 825.00, 1215.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(74, '1SSSR025001', 'สารปรับปรุงดิน 25 ก.ก.', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 240.00, 435.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(76, '1SDSR050001', 'สิงห์ชมพู 50 กก. 6-3-3', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 790.00, 1150.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(77, 'PTTM500001', 'ซุปเปอร์ไตรโค ', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 250.00, 1000, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(78, 'PHTM500001', 'บิวเมธามิค', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 290.00, 1000, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(79, 'PBTM500001', 'ซุปเปอร์บีที ', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 350.00, 500, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(80, 'PITM150001', 'ซุปเปอร์ไบโอ ตราเทพมงคล ขนาด 150 กรัม', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 510.00, 100, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(81, 'LCTM500001', 'ไคโตซาน ', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 250.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(82, 'LATM01L001', 'ปุ๋ยน้ำอะมิโนมิค ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 740.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(85, 'FR-PN001', 'เสื้อ', '', 'ของแถม', 'ชิ้น', 0.00, 0.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(89, 'A001', 'ย่อยสลายฟาง', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(90, 'SCSR050001', 'ปุ๋ยอินทรีย์เคมี สิงห์ส้ม 12-4-4 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 1215.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(91, 'LNTM01L001', 'ปุ๋ยเคมีน้ำ 21-3-3 ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 440.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(92, '3SOSR025001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 0.00, 445.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(93, 'A005', 'สารปรับปรุงดิน', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(95, '3SOSR050001', 'สิงห์ทอง 50 ก.ก. ปุ๋ยอินทรีย์', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 790.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(96, 'A007', 'สารจับใบ', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 0.00, 0, 7, 'แสนพรีม่า', 'Inactive', NULL),
(97, 'LNTM01L002', 'ปุ๋ยเคมีน้ำ 4-24-24 ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 540.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(98, 'A009', 'จับใบ 500cc', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 0.00, 0, 7, 'แสนพรีม่า', 'Inactive', NULL),
(99, 'A010', 'ไฮมิคสารจับใบ', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 0.00, 0, 7, 'แสนพรีม่า', 'Inactive', NULL),
(100, 'A011', 'ไฮมิค 500 ซีซี', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 0.00, 0, 7, 'แสนพรีม่า', 'Inactive', NULL),
(101, 'A012', 'สิงห์เขียว 50 กก.', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(102, 'A014', 'แสนราชสีห์ 25  KG', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 0.00, 0.00, 0, 7, 'แสนพรีม่า', 'Inactive', NULL),
(103, 'A015', 'แสนราชสีห์ 50 Kg', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(104, 'A016', 'เสื้อ', '', 'ของแถม', 'ชิ้น', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(105, 'A017', 'ไบโอ', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(106, 'A018', 'สิงห์ทอง 25 กก', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(107, 'LFTM01L001', 'แคลโบมิคพลัส ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 440.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(108, 'A020', 'สิงห์ชมพู', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(109, '1SDSR025001', '6-3-3 25กก', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 0.00, 670.00, 0, 6, 'แสนพรีม่า', 'Active', NULL),
(110, 'PTSR001001', 'สิงห์บูส', '', 'ชีวภัณฑ์', 'ซอง', 0.00, 290.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(111, 'UNKNOWN-PRODUCT-COMPANY6', 'ไม่ระบุสินค้า', 'ไม่ระบุ', 'ไม่ระบุ', 'ไม่ระบุ', 0.00, 0.00, 0, 6, 'เทพมงคล', 'Active', NULL),
(112, 'UNKNOWN-PRODUCT-COMPANY1', 'ไม่ระบุสินค้า', 'ไม่ระบุ', 'ไม่ระบุ', 'ไม่ระบุ', 0.00, 0.00, 0, 1, 'เทพมงคล', 'Inactive', NULL),
(113, 'UNKNOWN-PRODUCT-COMPANY2', 'ไม่ระบุสินค้า', 'ไม่ระบุ', 'ไม่ระบุ', 'ไม่ระบุ', 0.00, 0.00, 0, 2, 'เทพมงคล', 'Inactive', NULL),
(114, 'FR-PN002', 'เสื้อแสนราชสีห์ (เทเลเซลล์)', '', 'เสื้อเทเลเซลล์', 'ตัว', 0.00, 0.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(115, '1SOSR025001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 445.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(116, '1SOSR050001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยเม็ด', 'กระสอบ', 0.00, 790.00, 0, 1, 'แสน-พรีม่าแพสชั่น', 'Active', NULL),
(117, 'FR-PN003', 'เสื้อแจ็คเก็ต (Jacket)', 'เสื้อแจ็คเก็ต (Jacket) สำหรับ VIP พรีออนิค', 'เสื้อ', 'ตัว', 0.00, 0.00, 0, 2, 'พรีออนิค', 'Active', NULL),
(118, 'UNKNOWN-PRODUCT-COMPANY5', 'ไม่ระบุสินค้า', 'ไม่ระบุ', 'ไม่ระบุ', 'ไม่ระบุ', 0.00, 0.00, 0, 5, 'เทพมงคล', 'Inactive', NULL),
(119, 'UNKNOWN-PRODUCT-COMPANY7', 'ไม่ระบุสินค้า', 'ไม่ระบุ', 'ไม่ระบุ', 'ไม่ระบุ', 0.00, 0.00, 0, 7, 'เทพมงคล', 'Inactive', NULL),
(120, '1SOSR050001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 790.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(121, '1SOSR025001', 'ปุ๋ยอินทรีย์ สิงห์ทอง ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 0.00, 445.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(122, '1SSSR025001', 'สารปรับปรุงดิน ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ย', 'กระสอบ', 0.00, 435.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(123, '1SDSR025001', 'ปุ๋ยอินทรีย์เคมี สิงห์ชมพู 6-3-3 ตราแสนราชสีห์ ขนาด 25 กิโลกรัม', '', 'ปุ๋ยกระสอบเล็ก', 'กระสอบ', 0.00, 670.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(124, 'SCSR050002', 'ปุ๋ยอินทรีย์เคมี สิงห์เขียว 4-4-12 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 1195.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(125, '1SDSR050001', 'ปุ๋ยอินทรีย์เคมี สิงห์ชมพู 6-3-3 ตราแสนราชสีห์ ขนาด 50 กิโลกรัม', '', 'ปุ๋ยกระสอบใหญ่', 'กระสอบ', 0.00, 1150.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(126, 'LSTM500001', 'สารจับใบ ไฮมิค ตราเทพมงคล ขนาด 500 ซีซี', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 290.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(127, 'LSTM01L001', 'สารจับใบ ไฮมิค ตราเทพมงคล ขนาด 1 ลิตร', '', 'ชีวภัณฑ์', 'ขวด', 0.00, 530.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL),
(128, 'FR-PN001', 'เสื้อ', '', 'ของแถม', 'ชิ้น', 0.00, 0.00, 0, 7, 'ปุ๋ยสิงห์ by แพพชั่น พลัส', 'Active', NULL),
(129, 'SKU-00998', 'สินค้าทดสอบ998', '', 'ชีวภัณฑ์', 'ขวด', 100.00, 120.00, 200, 1, 'เทพมงคล', 'Inactive', '2026-01-08 10:45:08'),
(130, 'FR-PL001', 'เสื้อเชื้อ', '', 'ของแถม', 'ชิ้น', 0.00, 0.00, 0, 7, 'สินค้าเกษตร By ภุมรินทร์', 'Active', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_products_company` (`company_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=131;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `fk_products_company` FOREIGN KEY (`company_id`) REFERENCES `companies` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
